In [2]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame({'Name':['John','Peter','Monica','Missy','Sheldon','Adam','Rita','Craig',np.nan]
                   ,'Age':[23,30,18,46,72,56,41,np.nan,33]
                   ,'Salary':[np.nan,50000,65000,np.nan,70000,60000,62000,np.nan,75000]
                   ,'Experience':[1,6,np.nan,12,20,8,12,np.nan,11]})

In [11]:
df.head(10)

      Name   Age   Salary  Experience
0     John  23.0      NaN         1.0
1    Peter  30.0  50000.0         6.0
2   Monica  18.0  65000.0         NaN
3    Missy  46.0      NaN        12.0
4  Sheldon  72.0  70000.0        20.0
5     Adam  56.0  60000.0         8.0
6     Rita  41.0  62000.0        12.0
7    Craig   NaN      NaN         NaN
8      NaN  33.0  75000.0        11.0

In [15]:
df.to_csv('Test.csv')

In [12]:
!pip install pyspark

Collecting pyspark
  Downloading https://files.pythonhosted.org/packages/45/b0/9d6860891ab14a39d4bddf80ba26ce51c2f9dc4805e5c6978ac0472c120a/pyspark-3.1.1.tar.gz (212.3MB)
     |████████████████████████████████| 212.3MB 71kB/s
Collecting py4j==0.10.9
  Downloading https://files.pythonhosted.org/packages/9e/b6/6a4fb90cd235dc8e265a6a2067f2a2c99f0d91787f06aca4bcf7c23f3f80/py4j-0.10.9-py2.py3-none-any.whl (198kB)
     |████████████████████████████████| 204kB 45.4MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.1.1-py2.py3-none-any.whl size=212767604 sha256=5f5509e5643f9c75a8924c2600f8e05b2826889a14f3ee6c3e6fdb53140c1983
  Stored in directory: /root/.cache/pip/wheels/0b/90/c0/01de724414ef122bd05f056541fb6a0ecf47c7ca655f8b3c0f
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9 pyspark-3.1.1

In [13]:
from pyspark.sql import SparkSession

In [14]:
spark = SparkSession.builder.appName('Practice').getOrCreate()

In [16]:
spark.read.csv('Test.csv',header=True,inferSchema=True)

DataFrame[_c0: int, Name: string, Age: double, Salary: double, Experience: double]

In [17]:
spark.read.csv('Test.csv',header=True,inferSchema=True).show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  7|  Craig|null|   null|      null|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

In [22]:
df_spark = spark.read.csv('Test.csv',header=True,inferSchema=True)

In [20]:
df_spark.show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  7|  Craig|null|   null|      null|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

#### Drop NA

In [25]:
df_spark.na.drop().show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  1|  Peter|30.0|50000.0|       6.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
+---+-------+----+-------+----------+

In [26]:
df_spark.na.drop(how="any").show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  1|  Peter|30.0|50000.0|       6.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
+---+-------+----+-------+----------+

In [27]:
df_spark.na.drop(how="all").show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  7|  Craig|null|   null|      null|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

In [30]:
df_spark.na.drop(how="any",thresh=3).show() # threshold = 3 means at least 3 non-null value should be present

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

In [31]:
df_spark.na.drop(how="any",subset=['Salary']).show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

#### Filling the Missing Value

In [41]:
df_spark.na.fill('-------').show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  7|  Craig|null|   null|      null|
|  8|-------|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

In [43]:
df_spark.fillna('---').show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  7|  Craig|null|   null|      null|
|  8|    ---|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

#### Imputing Missing Values

In [44]:
from pyspark.ml.feature import Imputer

In [45]:
imputer = Imputer(
    inputCols = ['Age','Salary','Experience'],
    outputCols = ["{}_imputed".format(c) for c in ['Age','Salary','Experience']]
).setStrategy("median")

In [46]:
imputer.fit(df_spark).transform(df_spark).show()

+---+-------+----+-------+----------+-----------+--------------+------------------+
|_c0|   Name| Age| Salary|Experience|Age_imputed|Salary_imputed|Experience_imputed|
+---+-------+----+-------+----------+-----------+--------------+------------------+
|  0|   John|23.0|   null|       1.0|       23.0|       62000.0|               1.0|
|  1|  Peter|30.0|50000.0|       6.0|       30.0|       50000.0|               6.0|
|  2| Monica|18.0|65000.0|      null|       18.0|       65000.0|              11.0|
|  3|  Missy|46.0|   null|      12.0|       46.0|       62000.0|              12.0|
|  4|Sheldon|72.0|70000.0|      20.0|       72.0|       70000.0|              20.0|
|  5|   Adam|56.0|60000.0|       8.0|       56.0|       60000.0|               8.0|
|  6|   Rita|41.0|62000.0|      12.0|       41.0|       62000.0|              12.0|
|  7|  Craig|null|   null|      null|       33.0|       62000.0|              11.0|
|  8|   null|33.0|75000.0|      11.0|       33.0|       75000.0|              11.0|
+---+-------+----+-------+----------+-----------+--------------+------------------+

#### Filter

In [47]:
df_pyspark = df_spark.dropna(how='any')

In [48]:
df_pyspark.show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  1|  Peter|30.0|50000.0|       6.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
+---+-------+----+-------+----------+

In [49]:
df_pyspark.filter('Age>=35').show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
+---+-------+----+-------+----------+

In [50]:
df_pyspark.filter('Age>=35').select(['Name','Salary']).show()

+-------+-------+
|   Name| Salary|
+-------+-------+
|Sheldon|70000.0|
|   Adam|60000.0|
|   Rita|62000.0|
+-------+-------+

In [54]:
df_spark.filter((df_spark['Name']!=np.nan) | (df_spark['Age']>=20)).show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  0|   John|23.0|   null|       1.0|
|  1|  Peter|30.0|50000.0|       6.0|
|  3|  Missy|46.0|   null|      12.0|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
|  8|   null|33.0|75000.0|      11.0|
+---+-------+----+-------+----------+

In [57]:
df_spark.filter((df_spark['Name']!= '') & (df_spark['Salary']>=20000)).show()

+---+-------+----+-------+----------+
|_c0|   Name| Age| Salary|Experience|
+---+-------+----+-------+----------+
|  1|  Peter|30.0|50000.0|       6.0|
|  2| Monica|18.0|65000.0|      null|
|  4|Sheldon|72.0|70000.0|      20.0|
|  5|   Adam|56.0|60000.0|       8.0|
|  6|   Rita|41.0|62000.0|      12.0|
+---+-------+----+-------+----------+

In [58]:
df_pyspark.filter(~(df_pyspark['Age']>=40)).show()

+---+-----+----+-------+----------+
|_c0| Name| Age| Salary|Experience|
+---+-----+----+-------+----------+
|  1|Peter|30.0|50000.0|       6.0|
+---+-----+----+-------+----------+